app/views/posts/index.html.erb

SELECT  `editors`.* FROM `editors` WHERE `editors`.`id` = 1 LIMIT 1
---
    </td>
    <td><%= link_to(post.editor.first_name, {:controller => 'editors', :action => 'show', :id => post.editor.id}) %></td>