app/views/posts/index.html.erb

          <div class="caption left-align col l10 m8 s8">
            <span><%= link_to slider_posts[0].categories.first.name, {:action => 'show', :id => slider_posts[0].id},
                   :class => "new-type-1" %></span><br>
---
SELECT  `categories`.* FROM `categories` INNER JOIN `categories_posts` ON `categories`.`id` = `categories_posts`.`category_id` WHERE `categories_posts`.`post_id` = 1  ORDER BY `categories`.`id` ASC LIMIT 1

            <div class="row">
              <%= render(:partial => "shared/big_card", :locals => {:post => posts_arr[6], :post_category => posts_arr[6].categories.first}) %>
---
SELECT `posts`.* FROM `posts`