app/views/posts/show.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1
---
              <a class="article-views" href="#"><i class="fa fa-eye"></i>3122 views</a>
              <a class="article-comments" href="#"><i class="fa fa-comment"></i><%= @single_post.comments.count %> Comments</a>

SELECT  `editors`.* FROM `editors` WHERE `editors`.`id` = 1 LIMIT 1
---
                    <div class="col s11">
                      <h6 class="name"><%= comment.editor.first_name + " " + comment.editor.first_name %></h6>

SELECT  `categories`.* FROM `categories` INNER JOIN `categories_posts` ON `categories`.`id` = `categories_posts`.`category_id` WHERE `categories_posts`.`post_id` = 1  ORDER BY `categories`.`id` ASC LIMIT 1
---
                    <span class="black-text">
                      <span class="card-section"><a href="#" class="type"><%= post.categories.first.name %></a></span><br>