app/controllers/comments_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`content`, `post_id`, `created_at`, `updated_at`) VALUES ('Trial', 1, '2015-12-29 10:59:46', '2015-12-29 10:59:46')
UPDATE `comments` SET `editor_id` = 1, `updated_at` = '2015-12-29 10:59:46' WHERE `comments`.`id` = 19
UPDATE `posts` SET `comment_count` = 1, `updated_at` = '2015-12-29 11:09:06' WHERE `posts`.`id` = 1
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 1
---
  def create
    @this_post = Post.find(params[:post_id])
    @new_comment = @this_post.comments.create(params.require(:comment).permit(:content))
    @new_comment.editor_id = 1;

    if @new_comment.save
      @this_post.comment_count = @this_post.comments.count