app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` IS NULL LIMIT 1
---
  def find_post
    @post = Post.find(params[:id])